[
  {
    "lat": 34.2449,
    "lng": -119.2593,
    "name": "Ventura Isle Marina",
    "images": ["IMG_2256.jpg", "IMG_2254.jpg"]
  },
  {
    "lat": 34.0531,
    "lng": -119.754,
    "name": "Fry's Harbor",
    "images": ["IMG_3212.jpg", "IMG_3219.jpg"]
  },
  {
    "lat": 34.0719,
    "lng": -119.8596,
    "name": "Painted Cave"
  },
  {
    "lat": 33.9687,
    "lng": -119.7075,
    "name": "Coches Prietos",
    "images": ["IMG_3221.jpg", "IMG_3215.jpg"]
  },
  {
    "lat": 33.479,
    "lng": -119.0205,
    "name": "Santa Barbara Island"
  },
  {
    "lat": 33.4677,
    "lng": -118.5248,
    "name": "Emerald Bay Anchorage",
    "images": ["IMG_3223.jpg"]
  },
  {
    "lat": 33.4677,
    "lng": -118.4904,
    "name": "Two Harbors"
  },
  {
    "lat": 33.347,
    "lng": -118.3265,
    "name": "Avalon",
    "images": ["IMG_3224.jpg", "IMG_3226.jpg"]
  },
  {
    "lat": 32.7654,
    "lng": -117.2477,
    "name": "Mariner's Basin",
    "images": ["IMG_3558.jpg"]
  },
  {
    "lat": 32.72614,
    "lng": -117.186,
    "name": "A-9, Cruiser's anchorage, San Diego",
    "images": ["IMG_3560.jpg", "IMG_3230.jpg", "IMG_3567.jpg", "IMG_3654.jpg", "IMG_3655.jpg"],
    "content": "## Personal Reflections\nSan Diego proved to be a bit of a sticky anchorage.  What I mean by sticky is that I found it very hard to leave, spending the entirety of a month in this anchorage alone.\n\nThis time was spent catching up with local friends, finishing some work contracts, and tracking down last minute supplies and repairs for the boat before heading into Mexico.\n\nHaving not spent this much time in San Diego before, I can say without a doubt that this is a world class city with plenty of awesome things to do during the day and the night.\n\nIt was here that I met some fellow cruisers, some very special people I am sure I will see somewhere down the line including Tyler (and his dog Kimber) of S/V Polaris, and amazing mysterious GiGi, a beautiful eccentric who I have adobted as another honerary grandmother.\n\nI was also fortunate enough to make the Aquaintence of Mike and Amanda of S/V Varuna, two people I have come to know very well as we spent the bulk of our travels down the Pacific Baja buddy boating.\n\n## Cruising Notes\nSan Diego Offers an amazing service to visiting yachties in the plethora of free anchorages available.  While any boat can use most of the anchorages free of charge for up to 72 hours per week, The port authority of San Diego has set aside the A-9 Anchorage for Boats registered outside the city of San Diego for a period of 1 month, which can be renewed up to 3 times (total) each year.\n\nThe process for reserving each anchorage can be done online (with the exception of the A-9 permit which must be obtained after an in person inspection by the harbor police).\n\nOnce anchored, you will find yourself just west of Harbor Island, and smack in front of the San Diego Airport and US Coast Guard Sector San Diego.  While the planes coming and going are cool for the first 30 minutes or so, they soon become a bit loud and bothersome.\n\nThe holding is exceptional, and other than the wake of larger boats passing by in the bay, the water is mostly calm and flat.\n\nThe view facing towards downtown San Diego, however, is fabulous, and for no reason that I could explain, I was treated to multiple firework shows each week which seemed to eminate from USS Midway Aircraft carrier permanently berthed on the SW end of San Diego's downtown.\n"
  },
  {
    "lat": 32.4068,
    "lng": -117.2418,
    "name": "Islas Coronados",
    "images": ["IMG_3656.jpg", "IMG_3657.jpg", "IMG_3658.jpg", "IMG_3661.jpg"],
    "content": "## Personal Reflections\nThe first stop on my journey south was a quick rest in front of Isla Coronado Sur.  While not officially checked in to mexico, I did crack open a well earned beer as I had finally crossed the border into a new country on my boat!\n\n## Cruising Notes\nThis is a fine roadstead anchorage that makes the passage from San Diego to ensenada a little more manageable as covering 60nm in a single day (while leaving and entering during day light hours) is quite difficult, especially in a smaller slower boat such as Padelesha.  While you are not allowed to go ashore on these islands, they do host some amazing diving (so I am told) and exceptional fishing.\n\nHolding is good, though the wind can be strong.  Look to drop your hook on the eastern side of the island just off the middle bight in the lee of the islands towering peaks.\n\nWatch out for fishing boats anchored a little further off the bight, as well as large tuna corrals and aquaculture common in Norther Baja."
  },
  {
    "lat": 31.859,
    "lng": -116.6262,
    "name": "Baja Naval, Ensenada",
    "images": ["IMG_3664.jpg"],
    "content": "## Personal Reflections\nChecking into Mexico is a bit of a beaurocratic excercise, but luckily with prep help of the Marina Agent's at Baja Naval I showed up to the Capatania (Port Captain's office) well prepared with all of my documents ready.  Having travelled to Ensenada a few times by land, I knew my first stop after checking in would be to visit the street food vendors that sell fresh sea food from carts off the main drag of Ensenada.\n\nOne thing I failed to account for, however, is that Monday (the day it happened to be) is something like a weekend for people in the culinary industry, and the usual carts I liked to visit were nowhere to be found.  After some more searching, I finally found a cart who was opportunistic enough to take advantage of the day's lack of competition, and sunk my teeth into more than a few morsels of ceviche and other delicious treats from the Sea.\n\nIf ever visiting Ensenada, I highly recomend checking out Hussan's Cantina for a very rich local nightlife experience with cold, cheap beer, live Mariachis wandering in and out, and of course, once enough patrons become libated, dancing and singing.\n\nIn total I spent a few nights enjoying Ensenada, and finishing up last minute prepartions before my first real passage, which would take me almost 250 nautical miles SSE to Islas San Benitos.  I also, unknowingly, picked up my first and only crew member of the journey down the peninsula in the form of some sort of stomach bacteria or parasite that would soon make its presence known in the form of 'Traveller's Diarrhea'.\n\n*To be clear, I do not think this came from the seafood street vendors, but rather a cheesy corn filled mess I bought after too much time at Hussan's one night on my way back to the marina.*\n\n## Cruising Notes\nWhile you can potentially anchor for free in the basin just SW of the first marina in Ensenada Harbor (I am told) this is temporary and sooner or later someone will come and request you move your boat to a marina.\n\nI found Baja Naval to be a pretty good value, especially when you include that for the $1USD/ft/night you also get a full service ship agent to help prepare you for the beuarocracy of checking into this Port of Entry.  The dock's are ratty, and there is a lot of surge so have your large fenders at the ready.  Bring extra US Dollars to pay he the marina here as they will rob you on the exchange rate if you try and pay in Pesos.\n\nThis is the last place you will find the more complete (more *Americanized*) super markets and supplies until reaching Cabo San Lucas, (with perhaps the exception of Puerto San Carlos, though I can't say for sure as I have never been), so plan accordingly.\n\nAlso, if cruising on a budget (if you are not cruising on a budget, you can probably disregard the rest of these cruising notes) you will probably spend the bulk of your initial expenses here in Ensenada as everything south until Cabo San Lucas is incredibly low priced."
  },
  {
    "lat": 28.3014,
    "lng": -115.575,
    "name": "Islas San Benito",
    "images": ["IMG_3665.jpg", "IMG_3682.jpg", "IMG_3683.jpg", "IMG_3685.jpg", "IMG_3687.jpg", "IMG_3691.jpg", "IMG_3696.jpg", "IMG_3697.jpg", "IMG_3698.jpg"]
  },
  {
    "lat": 28.0824,
    "lng": -115.3341,
    "name": "Cedros SW anchorage",
    "images": ["IMG_3700.jpg"]
  },
  {
    "lat": 27.6878,
    "lng": -115.2294,
    "name": "Gybe!"
  },
  {
    "lat": 27.6831,
    "lng": -114.8798,
    "name": "Bahia Tortuga",
    "images": ["IMG_3711.jpg", "IMG_3723.jpg", "IMG_3724.jpg", "IMG_3725.jpg", "IMG_3727.jpg"]
  },
  {
    "lat": 27.20877,
    "lng": -114.8939,
    "name": "Running Along!",
    "images": ["IMG_3672.jpg"]
  },
  {
    "lat": 27.1296,
    "lng": -114.2724,
    "name": "Bahia Ascension",
    "images": ["IMG_3743.jpg"]
  },
  {
    "lat":  26.2996,
    "lng": -113.7076,
    "name": "Where Did the Wind Go?",
    "images": ["IMG_3214.jpg"]
  },
  {
    "lat":  26.2465,
    "lng": -112.4612,
    "name": "San Juanico",
    "images": ["IMG_3745.jpg", "IMG_3746.jpg"]
  },
  {
    "lat": 24.7755,
    "lng": -112.2496,
    "name": "Bahia Santa Maria",
    "images": ["IMG_3758.jpg"]
  },
  {
    "lat": 23.8967,
    "lng": -111.9600,
    "name": "Sleepy Gybe 1"
  },
  {
    "lat":  22.7341,
    "lng": -110.3553,
    "name": "Sleepy Gybe 2",
    "images": ["IMG_3764.jpg", "IMG_3766.jpg"]
  },
    {
    "lat":  22.8895,
    "lng": -109.8999,
    "name": "Cabo San Lucas",
    "content": "## Personal Reflections\nI ended up spending more time (and as a byproduct, money) here than I would have liked.  Cabo is a place accessible to anyone who can afford the airfare and hotel fee, and was quite different than my time cruising down the pacific coast.\n\nWhile there is a lot to gripe and grumble about as a cruiser, my personal highlights of this strange town include:\n\n* Running into an old friend I met once in Tahiti, whom I had not seen for 10 years\n* Catching the left of my life at the local surf spot 'Monuments',\n* Eating delicious garlic soaked seafood at Las Tres Islas,\n* Going to the movie theater (hey its been a while! And it was one of the cheaper activities in town),\n* Diving Pelican rock and seeing a shoal of MobulaMobula rays,\n* Mobula rays in general, especially when they jump out of the water in what looks like an attempt to take flight.\n* Making a $100 (pesos) eating pizza.  The pizza ended up being free, along with drinks and some new friends!\n\nOne could spend their entire time in Cabo drinking, and I definitely did my fair share of that activity, but after about a week I grew antsy to leave.  I met a man named Willie who wanted to crew with me to La Paz.  I had grown quiet accustomed to traveling by myself by this point, and was ready to leave before he was so we parted ways.  I also might have broken his surfboard one evening while we traded boards at 'Monuments' but I was able to find the local surf shop in town and get him a replacement.\n\n## Cruising Notes\nThe anchorage is secure, and best taken near the marina entrance on the north side of the bay.  A submarine canyon runs through the middle of the bay, but a nice sandy shelf runs along the beach in front of the hotels.  The water is warm, and you can look 30 feet straight down and see your anchor set.\n\nAnchorage can alternately be taken by 'Lands End' the impressive rock structure that guards the bay from southerly weather and seas.  In fair weather, one can even move to the picturesque Bahia Santa Maria, or Bahia Chileno a few miles East, but these are exposed to the south and should be avoided in all but the nicest of weather.\n\nBe advised, this is a really crowded noisy anchorage.  You will be rock and rolled all day by jetskiesjet skis and water taxies speeding around the bay.  You will be rock and rolled all night by loud music emanating from the endless party that is 'Mango Deck.'  They play the same set every night, much as I imagine Hell to be like.\n\nMost cruising guides talk about how expensive Cabo San Lucas is and how one should stop here only to check into the country (if not already completed in Ensenada) and to reprovision before making the 142 mile trek north to La Paz.\n\nIt is true that Cabo San Lucas is expensive, but only if you spend the entirety of your time in the tourist district and mall adjacent to the marina. Given some time, there is some rich local nightlife to be discovered, as well as restaurants that cater to the people who actually live in this city, as opposed to those who come for the 'eternal spring break' its tourism offices promote.\n\nMy personal recomendations include trying to catch some live music at 'Havana Underground.'  Skip 'Mariscos Mazatlan' and walk another block north to find 'Restaruantes Las Tres Islas' for better seafood (and better prices).\n"
  },
  {
    "lat": 23.1469,
    "lng": -109.3664,
    "name": "no wind, lots of cell service"
  },
  {
    "lat": 23.3809,
    "lng": -109.4218,
    "name": "Los Frailes",
    "content": "## Personal Reflections\nThe passage over to Los Frailes was hot and lacking of much wind.  As the sun was so hot, and I completely alone, I chose to do most of the sailing naked.  If one ever has the opportunity to sail naked as such, I highly recommend taking advantage of the opportunity.\n\nI ended up motoring most of the way until I passed San Jose Del Cabo and the wind picked up. This was the first time I ran the engine for any significant period of time since leaving San Diego, and the first time I ran the engine at all since I left Bahia Ascension. \n\nWhile I don't like to make a habit of such things, I arrived at Bahia Los Frailes well after dark, and luckily had a good way point by which to find my spot for the night.  The next morning I ran into Mary again (of S/V Minuet), who I hadn't seen since we briefly hung out in Los Cabos before she took off.\n\n### There is something About Mary\n*I want to take a minute to talk about Mary because she really deserves her own section.  I first met Mary when I was anchored in Two Harbors back in Catalina. I will not try and guess Mary's age, but suffice it to say she is well seasoned (definitely retired) and sailing alone on her 30 foot sloop S/V Minuet.*\n\n*I have an undying respect for this woman, especially after talking to her for some time about how different our experiences single-handing down the coast of Baja had been.*\n\n*We have a mixed reputation, single-handers.  At best we are viewed as jovial eccentrics with a death wish.  At worst, an irresponsible lot of scumbags who don't keep watch (I mean everyone has to sleep at some point...)*\n\n*That being said, my experience as a young man sailing by himself has been absolutely divine.  The people I meet all go out of their way to help, or offer me food and drink, or give me things they think I will need.*\n\n*I was shocked (but not terribly surprised) to find that Mary's experience as an older woman was quite different than mine.  Many of the people she encountered -- especially her own family, as well as many of the locals -- had treated her with disdain and callously commented on how she would spend her time better at home cooking for some husband (she is still unmarried to this day).*\n\n*Of all the wonderful people I have met on this journey so far, only three others have been sailing solo, and she has been the only woman.*\n\n### Under the sea\nThe diving here in Los Frailes is exceptional.  Around the corner is Pulmo reef, One of only three hard coral Colonies in North America (and as far as I know, the only one on the west coast).\n\nIn just a few hours of skin diving in less than 60 feet I saw:\n\n* numerous large coral structures growing on the rocks,\n* a fully exposed Moray Eel\n* A pretty large shark that took me quite off guard (find species)\n* A bullseye electric ray hiding under a rock.\n* Many tropical fish that I hadn't seen until rounding Los Cabos\n* colorful nudibranchs\n* shoaling Mackerels, (tropical fish?), and more Mobula Rays\n\nAs a national park, there is an absurd set of rules here about how one engages with the aquatic environment, which at times felt a bit like a hustle, and mostly like a deterrent to cruisers in general.\n\nI did my homework and read online all the regulations that needed to be adhered to as well as the park boundaries.  Staying south of the noted boundaries, and knowing I needed a guide to visit any dive sites within the park, I set out on my dinghy to go and enjoy some skin diving in the rock piles under 'Los Frailes.'\n\nNot even 5 minutes after I showed up, a boat full of paying snorkelers and their guide drove by to remind me I was in a national park and that I really wasn't allowed to be snorkeling without a certified guide.\n\n'I am a certified guide, I am a PADI Open Water Scuba Instructor,' I replied.  I knew if I wanted to scuba dive within the park I would need a guide who had the permits to lead within the park, but I still insisted I wasn't in the park.\n\nI was then told I could not anchor my dinghy (not withstanding I was less than 250 yards east of 5 boats anchored in the bay).\n\n'No problemo, I will be my own anchor,' I said, showing them I had tied the painter of my dinghy around my waist. (I later found another, literal, loop hole in that instead of using an anchor I tied the painter around a rock I had found underwater).\n\nStill power hungry, the dive guide, in front of all his private paying patrons, then told me I had to wear a life jacket while I snorkeled.  I don't know how one would freedive with a life vest, and activity I leave as an excercise to the reader.\n\n'I have read the rules and I am following them as best as I know how.  If you think I am still breaking the rules, I invite you to go find someone with the authority to get me in trouble.' And with that, the guide shrugged and drove off.\n\nI don't want to condone giving lip service to these folks.  I am all for supporting the national park and preserving this natural treasure.  However, I think that there is a definite disdain towards cruisers who come and visit the area in general, and if anyone from the Mexican Board of Tourism stumbles on my site, I encourage them to reach out to me to have a reasonable discussion on how to better capitalize on the cruisers coming through the area.\n\nEven if I wanted to pay for a guide to dive the Pulmo reef, there is very little I could do to get over to one of the 7 dive shops 6 miles away -- seeing as I can not anchor my boat in the park, and I have no car.  I asked if they would be willing to come get me in the morning before all the other tourists showed up and the politely declined.\n\nThe diving in this area is still amazing, despite the odd dance one has to do to make sure they follow the Maoist doctrine of the national park guides (whom I suspect are motivated not only by the altruism of guarding the park but also perhaps by possibility of further lining their pockets to sustain tourism in the area).  A definite must see!\n\n## Cruising Notes\nLos Frailes provides very good protection from Northerly weather and moderate protection from the east and even South East as long as the wind and the waves are not strong.  Like the bathymetry of Cabo San Lucas, the bay is free of obstructions and is cut down the middle by a large submarine canyon.  The best holding is along a shelf of sand in 3-6 fathoms on the Northeast corner of the bay.\n\nThe diving is obviously excellent, but the national marine park adjacent to this anchorage has strict rules see Personal Reflections above for further gripes...\n\nDinghy landing can be tough as this anchorage is still exposed to pacific southerly ground swell.  There is a very nicely formed sand bar break about 2 miles south of the anchorage (watch for the reef though, about a mile and a half from shore) but it only works on a strong S-SE in a medium low tide.  Otherwise it breaks on the beach and is unsurfable.  Further south is a longer point break (right) at Boca Del Tule.\n\nThe hike up the rocks ('Los Frailes') is well worth the work and one is rewarded, on a clear day by a clear panoramic view of the Pulmo reef area and Los Frailes bay.  Follow the 'trail' from the beach, and if you get lost there are plenty of man made rock piles to keep you on track.\n\nThe eye level view of the turkey vultures and falcons that seem to live on the beach is ominous.  If one so desires, a strong 3G connection from Telcel is available at the top of the peak coming from a cell tower on the next mountain over to the Northwest.\n"
  },
  {
    "lat": 23.3766,
    "lng": -109.4099,
    "name": "Don't hit the Friars"
  },
  {
    "lat":  23.5620,
    "lng": -109.4193,
    "name": "Punta Arena"
  },
  {
    "lat": 23.9887,
    "lng": -109.8297,
    "name": "Ensenada De Los Muertos (Sueños)",
    "content": "## Personal Reflections\nAs I roadsteaded here and did not leave the boat during my stay I have little to report other than the water was clear and the anchorage a bit rolly due to a bit of windchop coming from the Southwest.\n\nThere was only one other motor boat anchored with me and we both left early with first light.  While the notion of visiting the restaurant here seemed nice, it seemed the water taxi service they offered was not available given that I am traveling through here in the off season.\n\nIt is a pretty bay, and being low on fuel but plenty on wind I chose to sail in and out of anchor.  Leaving in the morning took a little longer than I would have liked, but I figured I would save my gasoline for a time when I would really need it.\n\nThe fisherman watched with curiosity as I had a couple of false starts getting underway with sail alone, but once I started moving it was easy going out of the bay and through Cervelo Channel."
  },
  {
    "lat": 23.9843,
    "lng": -109.8173,
    "name": "Slowly But Surely",
    "content": "The Fisherman laugh at me as I try and sail away, they shake their head, but I am low on fuel and there is a slight breeze so I make my way slowly and eventually the wind picks up."
  },
  {
    "lat": 24.0781,
    "lng": -109.7432,
    "name": "Naked Sailing",
    "content": "When You are by yourself, no one can object to your decision to not wear pants."
  },
  {
    "lat": 24.0797,
    "lng": -109.8278,
    "name": "Cervello Strait",
    "content": "Wind is picking up, but at least it is coming from the south which apparently is rare. Average speed over ground (with current and waves) is 7.5 knots! This is very fast for my small old boat."
  },
  {
    "lat": 24.3986,
    "lng": -110.2037,
    "name": "Straight of San Lorenzo",
    "content": "Clearly named after me..."
  },
  {
    "lat": 24.3292,
    "lng": -110.3887,
    "name": "Here come the Coromuels",
    "content": "The Coromuels are a very sudden strong localized wind that blows most evenings from the SW in Bahia La Paz during the summertime. This was the first time I had to sail upwind, in 20-25 knots of wind nonetheless, and definitely took me off guard."
  },
  {
    "lat": 24.2040,
    "lng": -110.3058,
    "name": "La Paz Channel",
    "content": "No Motor? No Problem... it only took about 20 short tacks to make it up the narrow deep water channel."
  },
  {
    "lat":  24.1608,
    "lng": -110.3303,
    "name": "La Paz"
  }
]
